app/views/static_pages/home.html.erb

				      <tr>
				        <td><%= will.client.first_name %></td>
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", 1]]