app/controllers/clients_controller.rb

  def index
    @clients = Client.all
---
SELECT "clients".* FROM "clients"

  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save
---
INSERT INTO "clients" ("first_name", "surname", "title", "date_of_birth", "employment_status", "marital_status", "maiden_name", "number_of_dependents", "dependents_names_ages", "nationality", "planned_retirement_age", "smoker", "address_1", "address_2", "town", "post_code", "country", "preferred_tel", "home_telephone", "mobile_telephone", "best_time", "email", "children_under_age", "employment_permanent", "occupation", "sick_pay_benefit", "user_id", "controlling_director", "accountant_details", "annual_income", "annual_expenses", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_client
      @client = Client.find(params[:id])
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", 1]]