app/controllers/infos_controller.rb

SELECT "infos".* FROM "infos"
---
  def index
    @infos = Info.all

INSERT INTO "infos" ("first_name", "surname", "email", "telephone_number", "financial_review", "estate_planning", "investments", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @info = Info.new(info_params)

    respond_to do |format|
      if @info.save

SELECT  "infos".* FROM "infos" WHERE "infos"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_info
      @info = Info.find(params[:id])