app/controllers/static_pages_controller.rb

SELECT "trusts".* FROM "trusts" WHERE "trusts"."completed" = 'f' AND "trusts"."user_id" = 1
SELECT "wills".* FROM "wills" WHERE "wills"."completed" = 'f' AND "wills"."user_id" = 1
SELECT "pensions".* FROM "pensions" WHERE "pensions"."completed" = 'f' AND "pensions"."user_id" = 1
---
  def home
  	@trust = Trust.where(:completed => false, :user => current_user.id)
  	@will = Will.where(:completed => false, :user => current_user.id)
  	@pension = Pension.where(:completed => false, :user => current_user.id)

SELECT "clients".* FROM "clients" WHERE "clients"."user_id" = 1
---
  def showclients
  	@client = Client.where(:user => current_user.id)