app/controllers/static_pages_controller.rb

  def home
  	@trust = Trust.where(:completed => false, :user => current_user.id)
  	@will = Will.where(:completed => false, :user => current_user.id)
  	@pension = PensionTransfer.where(:completed => false, :user => current_user.id)
---
SELECT "pension_transfers".* FROM "pension_transfers" WHERE "pension_transfers"."completed" = 'f' AND "pension_transfers"."user_id" = 1