app/controllers/trusts_controller.rb

  def index
    @trusts = Trust.all
---
SELECT "trusts".* FROM "trusts"

  def create
    @trust = Trust.new(trust_params)

    respond_to do |format|
      if @trust.save
---
INSERT INTO "trusts" ("client_id", "provider", "type_of_cover", "total_value", "payment_received", "loa_sent_to_client", "loa_signed_and_received", "loa_sent_to_provider", "information_received_from_provider", "completed", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @trust.update(trust_params)
---
UPDATE "trusts" SET "information_received_from_provider" = ?, "completed" = ?, "updated_at" = ? WHERE "trusts"."id" = ?  [["information_received_from_provider", "t"], ["completed", "t"], ["updated_at", "2016-02-26 12:02:24.489549"], ["id", 1]]

  def destroy
    @trust.destroy
---
DELETE FROM "trusts" WHERE "trusts"."id" = ?  [["id", 1]]

    def set_trust
      @trust = Trust.find(params[:id])
---
SELECT  "trusts".* FROM "trusts" WHERE "trusts"."id" = ? LIMIT 1  [["id", 2]]