app/controllers/wills_controller.rb

  def index
    @wills = Will.all
---
SELECT "wills".* FROM "wills"